surfaceMountedCube/fullCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (turbulenceModelSchemes);

application pimpleFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 30;

deltaT 0.002;

writeControl timeStep;

writeInterval 100;

purgeWrite 5;

writeFormat binary;

writePrecision 6;

writeCompression off;

timeFormat general;

timePrecision 6;

runTimeModifiable true;


functions
{
    // control mean and standard deviation
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       0;

        fields
        (
            U
            {
                mean on;
                prime2Mean on;
                base time;
            }

            p
            {
                mean on;
                prime2Mean on;
                base time;
            }
        );
    }

    // sample pressure on cube surface
    surface1
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        surfaceFormat   raw;
        fields          (p);

        surfaces
        {
            cube
            {
                type patch;
                patches (cube);
                interpolate false;
                invariant true;
                surfaceFormat raw;
            }
        }
    }
    surface2 // vtk for visualization in ParaView
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        surfaceFormat   raw;
        fields          (p);

        surfaces
        {
            cube
            {
                type patch;
                patches (cube);
                interpolate false;
                invariant true;
                surfaceFormat vtk;
            }
        }
    }

    // control forces acting on cube
    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             false;
        patches         (cube);
        coefficients    (Cd Cs Cl);
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        rhoInf          1.0;
        rho             rhoInf;
        magUInf         1.0;
        lRef            1.0;
        Aref            1.0;
    }

    // probe velocity field
    probes1
    {
        type            probes;
        libs            (sampling);
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        startTime       0.0;
        fields          (U);
        fixedLocations  true;
        interpolationScheme cell;

        probeLocations
        (
            // upstream probes
            (3 3.5 0.5)
            (3 4.5 0.5)
            (3 5.5 0.5)
            // probes next to cube
            (4 3.5 0.5)
            (4 5.5 0.5)
            // first row of wake probes
            (5 3.5 0.5)
            (5 4.5 0.5)
            (5 5.5 0.5)
            // second row of wake probes
            (7 3.5 0.5)
            (7 4.5 0.5)
            (7 5.5 0.5)
            // probes above cube
            (3.6 4.1 1.1)
            (3.6 4.5 1.1)
            (3.6 4.9 1.1)
            (4 4.1 1.1)
            (4 4.5 1.1)
            (4 4.9 1.1)
        );
        includeOutOfBounds  false;
    }
}

// ************************************************************************* //
